console.log('연습 시작 ===========================================')

// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
const NAME = '김가가'
// - 나이(변수)
let age = 33;
// - 학생 여부(상수)
const STUDENT = 'Y'
// - 모든 정보를 한 번에 출력해보세요.
console.log('이름 :', NAME, '나이 :', age, '학생 여부 :', STUDENT)

// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const countNumberA = 1
// - 숫자2(상수)
const countNumberB = 2
// - 결과(변수)
console.log(countNumberA + countNumberB)

// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const PRODUCT = '상품A'
// - 가격(변수)
let productPrice = 28000
// - 재고 있음(변수)
let inventory = 'Y'
// - 할인율(상수)
let discount = 20

console.log('상품명 :', PRODUCT, '가격 :', productPrice, '재고 :', inventory, '할인율 :', discount)
